wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Source/gd32f50x_rcu.c
/*!
    \file    gd32f50x_rcu.c
    \brief   RCU driver

    \version 2025-11-10, V1.0.1, firmware for GD32F50x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32f50x_rcu.h"

/* define clock source */
#define SEL_IRC8M                   ((uint16_t)0U)  /* IRC8M is selected as CK_SYS */
#define SEL_HXTAL                   ((uint16_t)1U)  /* HXTAL is selected as CK_SYS */
#define SEL_PLL0P                   ((uint16_t)2U)  /* PLL0P is selected as CK_SYS */

/* define startup timeout count */
#define OSC_STARTUP_TIMEOUT         ((uint32_t)0x000FFFFFU)
#define LXTAL_STARTUP_TIMEOUT       ((uint32_t)0x03FFFFFFU)

/* ADC clock prescaler offset */
#define RCU_ADC_PSC_OFFSET          ((uint32_t)14U)

/* RCU IRC8M adjust value mask and offset*/
#define RCU_IRC8M_ADJUST_MASK       ((uint8_t)0x1FU)
#define RCU_IRC8M_ADJUST_OFFSET     ((uint32_t)3U)

/* RCU PLL1 clock multiplication factor offset */
#define RCU_CFG1_PLL1MF_OFFSET      ((uint32_t)8U)
/* RCU PREDIV1 division factor offset*/
#define RCU_CFG1_PREDIV1_OFFSET      ((uint32_t)4U)
/* RCU PREDIV0 division factor offset*/
#define RCU_CFG1_PREDIV0_OFFSET      ((uint32_t)0U)

/* RCU parameter mask */
#define RCU_ADCPSC_MASK            (0x0000000FU)        /* RCU ADC prescaler select mask */

/*!
    \brief      deinitialize the RCU (API_ID(0x0001U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_deinit(void)
{
    /* enable IRC8M */
    RCU_CTL |= RCU_CTL_IRC8MEN;
    rcu_osci_stab_wait(RCU_IRC8M);

    RCU_CFG0 &= ~RCU_CFG0_SCS;

    /* reset CTL register */
    RCU_CTL &= ~(RCU_CTL_HXTALEN | RCU_CTL_HCKMEN | RCU_CTL_PLL0EN | RCU_CTL_PLL1EN);
    RCU_CTL &= ~RCU_CTL_HXTALBPS;

    /* reset CFG0 register */
    RCU_CFG0 &= ~(RCU_CFG0_SCS | RCU_CFG0_AHBPSC | RCU_CFG0_APB1PSC | RCU_CFG0_APB2PSC |
                  RCU_CFG0_ADCPSC | RCU_CFG0_PREDIV0_LSB | RCU_CFG0_PLL0MF_0_3 |
                  RCU_CFG0_USBFSPSC | RCU_CFG0_CKOUTSEL | RCU_CFG0_PLL0MF_4_5 | RCU_CFG0_USBFSPSC_2);
    /* reset INT register */
    RCU_INT = 0x01BF0000U;

    /* reset ADDINT register */
    RCU_ADDINT = 0x00400000U;

    /* reset CFG1 register */
    RCU_CFG1 &= ~(RCU_CFG1_PREDIV0 | RCU_CFG1_PREDIV1 | RCU_CFG1_PLL1MF | RCU_CFG1_PLL1SEL | RCU_CFG1_PLL0SEL
                  | RCU_CFG1_I2S1SEL | RCU_CFG1_I2S2SEL | RCU_CFG1_ADCPSC_3 | RCU_CFG1_HXTALRDYRST);

    /* reset PLLBWCFG register */
    RCU_PLLBWCFG &= ~(RCU_PLLBWCFG_PLL0_BW_CFG | RCU_PLLBWCFG_PLL1_BW_CFG);
    
    /* reset DSV register */
    RCU_DSV = 0x000A0000U;

    /* reset CKFMCFG0 register */
    RCU_CKFMCFG0 = 0x00000010U;
    /* reset CKFMCFG1 register */
    RCU_CKFMCFG1 = 0x80000000U;
    /* reset CKFMCFG2 register */
    RCU_CKFMCFG2 = 0x80000000U;
    /* reset CKFMCFG3 register */
    RCU_CKFMCFG3 = 0x80000000U;

    /* reset ADDCTL register */
    RCU_ADDCTL &= ~(RCU_ADDCTL_CK48MSEL | RCU_ADDCTL_FMCSEL | RCU_ADDCTL_I2S1DIV | RCU_ADDCTL_PLL0DIV 
                    | RCU_ADDCTL_FMCDIV | RCU_ADDCTL_I2S2DIV);
}

/*!
    \brief      enable the peripherals clock (API_ID(0x0002U))
    \param[in]  periph: RCU peripherals, refer to rcu_periph_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_DMAx (x = 0,1): DMA clock
      \arg        RCU_CRC: CRC clock
      \arg        RCU_EXMC: EXMC clock
      \arg        RCU_USBFS: USBFS clock
      \arg        RCU_CAU: CAU clock
      \arg        RCU_HAU: HAU clock
      \arg        RCU_TRNG: TRNG clock
      \arg        RCU_DMAMUX: DMAMUX clock
      \arg        RCU_TIMERx (x = 0,1,2,3,4,5,6,7,16): TIMER clock
      \arg        RCU_WWDGT: WWDGT clock
      \arg        RCU_SPIx (x = 0,1,2): SPI clock
      \arg        RCU_USARTx (x = 0,1,2): USART clock
      \arg        RCU_UARTx (x = 3,4): UART clock
      \arg        RCU_I2Cx (x = 0,1): I2C clock
      \arg        RCU_CMP: CMP clock
      \arg        RCU_BKPI: BKP interface clock
      \arg        RCU_PMU: PMU clock
      \arg        RCU_DAC: DAC clock
      \arg        RCU_RTC: RTC clock
      \arg        RCU_CTC: CTC clock
      \arg        RCU_AF : alternate function clock
      \arg        RCU_GPIOx (x = A,B,C,D,E): GPIO ports clock
      \arg        RCU_ADCx (x = 0,1,2): ADC clock
      \arg        RCU_TRIGSEL: TRIGSEL clock
      \arg        RCU_SYSCFG:SYSCFG clock
      \arg        RCU_CANx (x = 0,1): CAN clock
    \param[out] none
    \retval     none
*/
void rcu_periph_clock_enable(rcu_periph_enum periph)
{
    RCU_REG_VAL(periph) |= BIT(RCU_BIT_POS(periph));
}

/*!
    \brief      disable the peripherals clock (API_ID(0x0003U))
    \param[in]  periph: RCU peripherals, refer to rcu_periph_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_DMAx (x = 0,1): DMA clock
      \arg        RCU_CRC: CRC clock
      \arg        RCU_EXMC: EXMC clock
      \arg        RCU_USBFS: USBFS clock
      \arg        RCU_CAU: CAU clock
      \arg        RCU_HAU: HAU clock
      \arg        RCU_TRNG: TRNG clock
      \arg        RCU_DMAMUX: DMAMUX clock
      \arg        RCU_TIMERx (x = 0,1,2,3,4,5,6,7,16): TIMER clock
      \arg        RCU_WWDGT: WWDGT clock
      \arg        RCU_SPIx (x = 0,1,2): SPI clock
      \arg        RCU_USARTx (x = 0,1,2): USART clock
      \arg        RCU_UARTx (x = 3,4): UART clock
      \arg        RCU_I2Cx (x = 0,1): I2C clock
      \arg        RCU_CMP: CMP clock
      \arg        RCU_BKPI: BKP interface clock
      \arg        RCU_PMU: PMU clock
      \arg        RCU_DAC: DAC clock
      \arg        RCU_RTC: RTC clock
      \arg        RCU_CTC: CTC clock
      \arg        RCU_AF : alternate function clock
      \arg        RCU_GPIOx (x = A,B,C,D,E): GPIO ports clock
      \arg        RCU_ADCx (x = 0,1,2): ADC clock
      \arg        RCU_TRIGSEL: TRIGSEL clock
      \arg        RCU_SYSCFG:SYSCFG clock
      \arg        RCU_CANx (x = 0,1): CAN clock
    \param[out] none
    \retval     none
*/
void rcu_periph_clock_disable(rcu_periph_enum periph)
{
    RCU_REG_VAL(periph) &= ~BIT(RCU_BIT_POS(periph));
}

/*!
    \brief      enable the peripherals clock when sleep mode (API_ID(0x0004U))
    \param[in]  periph: RCU peripherals, refer to rcu_periph_sleep_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_SRAM_SLP: SRAM clock
      \arg        RCU_FMC_SLP: FMC clock
    \param[out] none
    \retval     none
*/
void rcu_periph_clock_sleep_enable(rcu_periph_sleep_enum periph)
{
    RCU_REG_VAL(periph) |= BIT(RCU_BIT_POS(periph));
}

/*!
    \brief      disable the peripherals clock when sleep mode (API_ID(0x0005U))
    \param[in]  periph: RCU peripherals, refer to rcu_periph_sleep_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_SRAM_SLP: SRAM clock
      \arg        RCU_FMC_SLP: FMC clock
    \param[out] none
    \retval     none
*/
void rcu_periph_clock_sleep_disable(rcu_periph_sleep_enum periph)
{
    RCU_REG_VAL(periph) &= ~BIT(RCU_BIT_POS(periph));
}

/*!
    \brief      reset the peripherals (API_ID(0x0006U))
    \param[in]  periph_reset: RCU peripherals reset, refer to rcu_periph_reset_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_USBFSRST: reset USBFS
      \arg        RCU_CAURST: reset CAU
      \arg        RCU_HAURST: reset HAU
      \arg        RCU_TRNGRST: reset TRNG
      \arg        RCU_DMAMUXRST: reset DMAMUX
      \arg        RCU_DMAxRST (x = 0,1): reset DMA
      \arg        RCU_TIMERxRST (x = 0,1,2,3,4,5,6,7,16): reset TIMER
      \arg        RCU_WWDGTRST: reset WWDGT
      \arg        RCU_SPIxRST (x = 0,1,2): reset SPI
      \arg        RCU_USARTxRST (x = 0,1,2): reset USART
      \arg        RCU_UARTxRST (x = 3,4): reset UART
      \arg        RCU_I2CxRST (x = 0,1): reset I2C
      \arg        RCU_CMPRST: reset CMP
      \arg        RCU_BKPIRST: reset BKPI
      \arg        RCU_PMURST: reset PMU
      \arg        RCU_DACRST: reset DAC
      \arg        RCU_CTCRST: reset CTC
      \arg        RCU_AFRST : reset alternate function
      \arg        RCU_ADCRST (x = 0,1,2): reset ADC
      \arg        RCU_GPIOxRST (x = A,B,C,D,E): reset GPIO ports
      \arg        RCU_TRIGSELRST: reset TRIGSEL
      \arg        RCU_SYSCFGRST:reset SYSCFG
      \arg        RCU_CANxRST (x = 0,1): reset CAN
    \param[out] none
    \retval     none
*/
void rcu_periph_reset_enable(rcu_periph_reset_enum periph_reset)
{
    RCU_REG_VAL(periph_reset) |= BIT(RCU_BIT_POS(periph_reset));
}

/*!
    \brief      disable reset the peripherals (API_ID(0x0007U))
    \param[in]  periph_reset: RCU peripherals reset, refer to rcu_periph_reset_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_USBFSRST: reset USBFS
      \arg        RCU_CAURST: reset CAU
      \arg        RCU_HAURST: reset HAU
      \arg        RCU_TRNGRST: reset TRNG
      \arg        RCU_DMAMUXRST:reset DMAMUX
      \arg        RCU_DMAxRST (x = 0,1): reset DMA
      \arg        RCU_TIMERxRST (x = 0,1,2,3,4,5,6,7,16): reset TIMER
      \arg        RCU_WWDGTRST: reset WWDGT
      \arg        RCU_SPIxRST (x = 0,1,2): reset SPI
      \arg        RCU_USARTxRST (x = 0,1,2): reset USART
      \arg        RCU_UARTxRST (x = 3,4): reset UART
      \arg        RCU_I2CxRST (x = 0,1): reset I2C
      \arg        RCU_CMPRST: reset CMP
      \arg        RCU_BKPIRST: reset BKPI
      \arg        RCU_PMURST: reset PMU
      \arg        RCU_DACRST: reset DAC
      \arg        RCU_CTCRST: reset CTC
      \arg        RCU_AFRST : reset alternate function
      \arg        RCU_ADCRST (x = 0,1,2): reset ADC
      \arg        RCU_GPIOxRST (x = A,B,C,D,E): reset GPIO ports
      \arg        RCU_TRIGSELRST: reset TRIGSEL
      \arg        RCU_SYSCFGRST:reset SYSCFG
      \arg        RCU_CANxRST (x = 0,1): reset CAN
    \param[out] none
    \retval     none
*/
void rcu_periph_reset_disable(rcu_periph_reset_enum periph_reset)
{
    RCU_REG_VAL(periph_reset) &= ~BIT(RCU_BIT_POS(periph_reset));
}

/*!
    \brief      reset the BKP domain (API_ID(0x0008U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_bkp_reset_enable(void)
{
    RCU_BDCTL |= RCU_BDCTL_BKPRST;
}

/*!
    \brief      disable the BKP domain reset (API_ID(0x0009U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_bkp_reset_disable(void)
{
    RCU_BDCTL &= ~RCU_BDCTL_BKPRST;
}

/*!
    \brief      configure the system clock source (API_ID(0x000AU))
    \param[in]  ck_sys: system clock source select
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKSYSSRC_IRC8M: select CK_IRC8M as the CK_SYS source
      \arg        RCU_CKSYSSRC_HXTAL: select CK_HXTAL as the CK_SYS source
      \arg        RCU_CKSYSSRC_PLL0P: select CK_PLL0P as the CK_SYS source
    \param[out] none
    \retval     none
*/
void rcu_system_clock_source_config(uint32_t ck_sys)
{
    uint32_t reg;

    reg = RCU_CFG0;
    /* reset the SCS bits and set according to ck_sys */
    reg &= ~RCU_CFG0_SCS;
    RCU_CFG0 = reg | (ck_sys & RCU_CFG0_SCS);
}

/*!
    \brief      get the system clock source (API_ID(0x000BU))
    \param[in]  none
    \param[out] none
    \retval     which clock is selected as CK_SYS source
      \arg        RCU_SCSS_IRC8M: CK_IRC8M is selected as the CK_SYS source
      \arg        RCU_SCSS_HXTAL: CK_HXTAL is selected as the CK_SYS source
      \arg        RCU_SCSS_PLL0P: CK_PLL0P is selected as the CK_SYS source
*/
uint32_t rcu_system_clock_source_get(void)
{
    return (RCU_CFG0 & RCU_CFG0_SCSS);
}

/*!
    \brief      configure the AHB clock prescaler selection (API_ID(0x000CU))
    \param[in]  ck_ahb: AHB clock prescaler selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_AHB_CKSYS_DIVx(x = 1, 2, 4, 8, 16, 64, 128, 256, 512): select CK_SYS / x as CK_AHB
    \param[out] none
    \retval     none
*/
void rcu_ahb_clock_config(uint32_t ck_ahb)
{
    uint32_t reg;

    reg = RCU_CFG0;

    /* reset the AHBPSC bits and set according to ck_ahb */
    reg &= ~RCU_CFG0_AHBPSC;
    RCU_CFG0 = reg | (ck_ahb & RCU_CFG0_AHBPSC);
}

/*!
    \brief      configure the APB1 clock prescaler selection (API_ID(0x000DU))
    \param[in]  ck_apb1: APB1 clock prescaler selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_APB1_CKAHB_DIV1: select CK_AHB as CK_APB1
      \arg        RCU_APB1_CKAHB_DIV2: select CK_AHB / 2 as CK_APB1
      \arg        RCU_APB1_CKAHB_DIV4: select CK_AHB / 4 as CK_APB1
      \arg        RCU_APB1_CKAHB_DIV8: select CK_AHB / 8 as CK_APB1
      \arg        RCU_APB1_CKAHB_DIV16: select CK_AHB / 16 as CK_APB1
    \param[out] none
    \retval     none
*/
void rcu_apb1_clock_config(uint32_t ck_apb1)
{
    uint32_t reg;

    reg = RCU_CFG0;

    /* reset the APB1PSC and set according to ck_apb1 */
    reg &= ~RCU_CFG0_APB1PSC;
    RCU_CFG0 = reg | (ck_apb1 & RCU_CFG0_APB1PSC);
}

/*!
    \brief      configure the APB2 clock prescaler selection (API_ID(0x000EU))
    \param[in]  ck_apb2: APB2 clock prescaler selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_APB2_CKAHB_DIV1: select CK_AHB as CK_APB2
      \arg        RCU_APB2_CKAHB_DIV2: select CK_AHB / 2 as CK_APB2
      \arg        RCU_APB2_CKAHB_DIV4: select CK_AHB / 4 as CK_APB2
      \arg        RCU_APB2_CKAHB_DIV8: select CK_AHB / 8 as CK_APB2
      \arg        RCU_APB2_CKAHB_DIV16: select CK_AHB / 16 as CK_APB2
    \param[out] none
    \retval     none
*/
void rcu_apb2_clock_config(uint32_t ck_apb2)
{
    uint32_t reg;

    reg = RCU_CFG0;

    /* reset the APB2PSC and set according to ck_apb2 */
    reg &= ~RCU_CFG0_APB2PSC;
    RCU_CFG0 = reg | (ck_apb2 & RCU_CFG0_APB2PSC);
}

/*!
    \brief      configure the CK_OUT clock source (API_ID(0x000FU))
    \param[in]  ckout_src: CK_OUT clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKOUTSRC_CKSYS: system clock selected
      \arg        RCU_CKOUTSRC_IRC8M: high speed 8M internal oscillator clock selected
      \arg        RCU_CKOUTSRC_HXTAL: HXTAL selected
      \arg        RCU_CKOUTSRC_CKPLL0_DIV2: CK_PLL0 / 2 selected
      \arg        RCU_CKOUTSRC_CKPLL1_DIV2: CK_PLL1 / 2 selected
      \arg        RCU_CKOUTSRC_LXTAL: LXTAL clock selected
      \arg        RCU_CKOUTSRC_IRC48M: high speed 48M internal oscillator clock selected
      \arg        RCU_CKOUTSRC_IRC40K: IRC40K clock selected
    \param[out] none
    \retval     none
*/
void rcu_ckout_config(uint32_t ckout_src)
{
    uint32_t reg;

    reg = RCU_CFG0;

    /* reset the CKOUTSRC, set according to ckout_src */
    reg &= ~RCU_CFG0_CKOUTSEL;
    RCU_CFG0 = reg | (ckout_src & RCU_CFG0_CKOUTSEL);
}

/*!
    \brief      configure the PLL0 clock (API_ID(0x0010U))
    \param[in]  pll0_src: PLL0 clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_PLL0SRC_IRC8M: IRC8M  clock selected as source clock of PLL0
      \arg        RCU_PLL0SRC_IRC48M: IRC48M selected as source clock of PLL0
      \arg        RCU_PLL0SRC_HXTAL: HXTAL selected as source clock of PLL0
      \arg        RCU_PLL0SRC_CKPLL1: CKPLL1 selected as source clock of PLL0
    \param[in]  pll0_mul: PLL0 clock multiplication factor
                only one parameter can be selected which is shown as below:
      \arg        RCU_PLL0_MULx (x = 4,5,6..63): PLL0 clock multiplication factor
    \param[in]  pll0_div: PLL0 clock division factor
                only one parameter can be selected which is shown as below:
      \arg        RCU_PLL0_DIVx (x = 1..16): PLL0 clock division division factor
    \param[out] none
    \retval     none
*/
void rcu_pll0_config(uint32_t pll0_src, uint32_t pll0_mul, uint32_t pll0_div)
{
    uint32_t reg = 0U;

