wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Source/gd32f50x_rcu.c
    reg = RCU_CFG1;

    /* PLL0 clock source and multiplication factor configuration */
    reg &= ~RCU_CFG1_PLL0SEL;
    reg |= pll0_src & RCU_CFG1_PLL0SEL;
    RCU_CFG1 = reg;

    reg = RCU_CFG0;
    reg &= ~(RCU_CFG0_PLL0MF_0_3 | RCU_CFG0_PLL0MF_4_5);
    reg |=  pll0_mul & (RCU_CFG0_PLL0MF_0_3 | RCU_CFG0_PLL0MF_4_5);
    RCU_CFG0 = reg;

    reg = RCU_ADDCTL;
    reg &= ~RCU_ADDCTL_PLL0DIV;
    reg |= pll0_div & RCU_ADDCTL_PLL0DIV;
    RCU_ADDCTL = reg ;
}

/*!
    \brief      configure the PLL1 clock (API_ID(0x0011U))
    \param[in]  pll1_src: pll1 clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_PLL1SRC_HXTAL: HXTAL  selected as source clock of PLL1
      \arg        RCU_PPLL1SRC_IRC48M: IRC48M selected as source clock of PLL1
    \param[in]  pll11_mul: PLL1 clock multiplication factor
                only one parameter can be selected which is shown as below:
      \arg        RCU_PLL1_MULx (x = 4,5,6..63): PLL1 clock multiplication factor
    \param[out] none
    \retval     none
*/
void rcu_pll1_config(uint32_t pll1_src, uint32_t pll1_mul)
{
    uint32_t reg = 0U;

    reg = RCU_CFG1;

    reg &= ~(RCU_CFG1_PLL1MF | RCU_CFG1_PLL1SEL);
    reg |= (pll1_mul & RCU_CFG1_PLL1MF) | (pll1_src & RCU_CFG1_PLL1SEL);
    RCU_CFG1 = reg;
}

/*!
    \brief      configure the PREDIV0 division factor (API_ID(0x0012U))
    \param[in]  prediv0_div: PREDIV0 division factor
                only one parameter can be selected which is shown as below:
      \arg        RCU_PREDIV0_DIVx (x = 1..16): PREDIV0 input source clock is divided x
    \param[out] none
    \retval     none
*/
void rcu_prediv0_config(uint32_t prediv0_div)
{
    uint32_t reg = 0U;

    reg = RCU_CFG1;
    /* reset PREDIV0SEL and PREDIV0 bits */
    reg &= ~ RCU_CFG1_PREDIV0;
    /* set the PREDIV0SEL and PREDIV0 division factor */
    reg |=  prediv0_div & RCU_CFG1_PREDIV0;

    RCU_CFG1 = reg;
}

/*!
    \brief      configure the PREDIV1 division factor (API_ID(0x0013U))
    \param[in]  prediv1_div: PREDIV1 division factor
                only one parameter can be selected which is shown as below:
      \arg        RCU_PREDIV1_DIVx (x = 1..16): PREDIV1 input source clock is divided x
    \param[out] none
    \retval     none
*/
void rcu_prediv1_config(uint32_t prediv1_div)
{
    uint32_t reg = 0U;

    reg = RCU_CFG1;
    /* reset the PREDIV1 bits */
    reg &= ~RCU_CFG1_PREDIV1;
    /* set the PREDIV1 division factor */
    reg |= prediv1_div & RCU_CFG1_PREDIV1;

    RCU_CFG1 = reg;
}

/*!
    \brief      configure the ADC prescaler factor (API_ID(0x0014U))
    \param[in]  adc_psc: ADC prescaler factor
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKADC_CKAPB2_DIV2: ADC prescaler select CK_APB2 / 2
      \arg        RCU_CKADC_CKAPB2_DIV4: ADC prescaler select CK_APB2 / 4
      \arg        RCU_CKADC_CKAPB2_DIV6: ADC prescaler select CK_APB2 / 6
      \arg        RCU_CKADC_CKAPB2_DIV8: ADC prescaler select CK_APB2 / 8
      \arg        RCU_CKADC_CKAPB2_DIV12: ADC prescaler select CK_APB2 / 12
      \arg        RCU_CKADC_CKAPB2_DIV16: ADC prescaler select CK_APB2 / 16
      \arg        RCU_CKADC_CKAHB_DIV3: ADC prescaler select CK_AHB / 3
      \arg        RCU_CKADC_CKAHB_DIV5: ADC prescaler select CK_AHB / 5
      \arg        RCU_CKADC_CKAHB_DIV6: ADC prescaler select CK_AHB / 6
      \arg        RCU_CKADC_CKAHB_DIV10: ADC prescaler select CK_AHB / 10
      \arg        RCU_CKADC_CKAHB_DIV20: ADC prescaler select CK_AHB / 20
    \param[out] none
    \retval     none
*/
void rcu_adc_clock_config(uint32_t adc_psc)
{
    uint32_t reg0, reg1;

    /* reset the ADCPSC bits */
    reg0 = RCU_CFG0;
    reg0 &= ~(RCU_CFG0_ADCPSC_2 | RCU_CFG0_ADCPSC);
    reg1 = RCU_CFG1;
    reg1 &= ~RCU_CFG1_ADCPSC_3;

    /* set the ADC prescaler factor */
    switch(adc_psc) {
    case RCU_CKADC_CKAPB2_DIV2:
    case RCU_CKADC_CKAPB2_DIV4:
    case RCU_CKADC_CKAPB2_DIV6:
    case RCU_CKADC_CKAPB2_DIV8:
        reg0 |= ((adc_psc & RCU_ADCPSC_MASK) << RCU_ADC_PSC_OFFSET);
        break;

    case RCU_CKADC_CKAPB2_DIV12:
    case RCU_CKADC_CKAPB2_DIV16:
        adc_psc &= ~BIT(2);
        reg0 |= (((adc_psc & RCU_ADCPSC_MASK) << RCU_ADC_PSC_OFFSET) | RCU_CFG0_ADCPSC_2);
        break;

    case RCU_CKADC_CKAHB_DIV3:
        reg1 |= RCU_CFG1_ADCPSC_3;
        break;

    case RCU_CKADC_CKAHB_DIV5:
    case RCU_CKADC_CKAHB_DIV6:
    case RCU_CKADC_CKAHB_DIV10:
    case RCU_CKADC_CKAHB_DIV20:
        adc_psc &= ~BITS(2, 3);
        reg0 |= ((adc_psc & RCU_ADCPSC_MASK) << RCU_ADC_PSC_OFFSET | RCU_CFG0_ADCPSC_2);
        reg1 |= RCU_CFG1_ADCPSC_3;
        break;
    default:
        break;
    }

    /* set the register */
    RCU_CFG0 = reg0;
    RCU_CFG1 = reg1;
}

/*!
    \brief      configure the USBFS prescaler factor (API_ID(0x0015U))
    \param[in]  usb_psc: USB prescaler factor
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKUSB_CKPLL0_DIV2: USBFS prescaler select CK_PLL0 / 2
      \arg        RCU_CKUSB_CKPLL0_DIV3: USBFS prescaler select CK_PLL0 / 3
      \arg        RCU_CKUSB_CKPLL0_DIV4: USBFS prescaler select CK_PLL0 / 4
      \arg        RCU_CKUSB_CKPLL0_DIV5: USBFS prescaler select CK_PLL0 / 5
      \arg        RCU_CKUSB_CKPLL0_DIV6: USBFS prescaler select CK_PLL0 / 6
      \arg        RCU_CKUSB_CKPLL0_DIV7: USBFS prescaler select CK_PLL0 / 7
      \arg        RCU_CKUSB_CKPLL0_DIV8: USBFS prescaler select CK_PLL0 / 8
    \param[out] none
    \retval     none
*/
void rcu_usb_clock_config(uint32_t usb_psc)
{
    uint32_t reg;

    reg = RCU_CFG0;
    reg &= ~RCU_CFG0_USBFSPSC;
    reg |= usb_psc & RCU_CFG0_USBFSPSC;

    RCU_CFG0 = reg;
}

/*!
    \brief      configure the RTC clock source selection (API_ID(0x0016U))
    \param[in]  rtc_clock_source: RTC clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_RTCSRC_NONE: no clock selected
      \arg        RCU_RTCSRC_LXTAL: CK_LXTAL selected as RTC source clock
      \arg        RCU_RTCSRC_IRC40K: CK_IRC40K selected as RTC source clock
      \arg        RCU_RTCSRC_HXTAL_DIV_128: CK_HXTAL / 128 selected as RTC source clock
    \param[out] none
    \retval     none
*/
void rcu_rtc_clock_config(uint32_t rtc_clock_source)
{
    uint32_t reg;

    reg = RCU_BDCTL;
    /* reset the RTCSRC bits and set according to rtc_clock_source */
    reg &= ~RCU_BDCTL_RTCSRC;
    reg |= rtc_clock_source & RCU_BDCTL_RTCSRC;
    RCU_BDCTL = reg;
}


/*!
    \brief      configure the I2S1 clock source selection (API_ID(0x0017U))
    \param[in]  i2s_clock_source: I2S1 clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_I2S1SRC_CKSYS: System clock selected as I2S1 source clock
      \arg        RCU_I2S1SRC_CKPLL1: CK_PLL1 selected as I2S1 source clock
    \param[in]  i2s_clock_div: i2s clock division factor
                only one parameter can be selected which is shown as below:
      \arg        RCU_I2S1_DIVx: (x = 1...32)
    \param[out] none
    \retval     none
*/
void rcu_i2s1_clock_config(uint32_t i2s_clock_source, uint32_t i2s_clock_div)
{
    uint32_t reg;

