wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Source/gd32f50x_rcu.c
    reg = RCU_CFG1;
    /* reset the I2S1SEL bit and set according to i2s_clock_source */
    reg &= ~RCU_CFG1_I2S1SEL;
    reg |= i2s_clock_source & RCU_CFG1_I2S1SEL;
    RCU_CFG1 = reg;

    /* reset the I2S1DIV bit and set according to i2s_clock_div */
    reg = RCU_ADDCTL;
    reg &= ~RCU_ADDCTL_I2S1DIV;
    reg |= i2s_clock_div & RCU_ADDCTL_I2S1DIV;
    RCU_ADDCTL = reg;
}

/*!
    \brief      configure the I2S2 clock source selection (API_ID(0x0018U))
    \param[in]  i2s_clock_source: I2S2 clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_I2S2SRC_CKSYS: system clock selected as I2S2 source clock
      \arg        RCU_I2S2SRC_CKPLL1: CK_PLL1 selected as I2S1 source clock
    \param[in]  i2s_clock_div: i2s clock division factor
                only one parameter can be selected which is shown as below:
      \arg        RCU_I2S2_DIVx: (x = 1...32)
    \param[out] none
    \retval     none
*/
void rcu_i2s2_clock_config(uint32_t i2s_clock_source, uint32_t i2s_clock_div)
{
    uint32_t reg;

    reg = RCU_CFG1;
    /* reset the I2S2SEL bit and set according to i2s_clock_source */
    reg &= ~RCU_CFG1_I2S2SEL;
    reg |= i2s_clock_source & RCU_CFG1_I2S2SEL;
    RCU_CFG1 = reg;

    /* reset the I2S2DIV bit and set according to i2s_clock_div */
    reg = RCU_ADDCTL;
    reg &= ~(RCU_ADDCTL_I2S2DIV);
    reg |= i2s_clock_div & RCU_ADDCTL_I2S2DIV;
    RCU_ADDCTL = reg;
}

/*!
    \brief      configure the CK48M clock source selection (API_ID(0x0019U))
    \param[in]  ck48m_clock_source: CK48M clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_CK48MSRC_CKPLL0: CK_PLL0 selected as CK48M source clock
      \arg        RCU_CK48MSRC_IRC48M: CK_IRC48M selected as CK48M source clock
    \param[out] none
    \retval     none
*/
void rcu_ck48m_clock_config(uint32_t ck48m_clock_source)
{
    uint32_t reg;

    reg = RCU_ADDCTL;
    /* reset the CK48MSEL bit and set according to ck48m_clock_source */
    reg &= ~RCU_ADDCTL_CK48MSEL;
    reg |= ck48m_clock_source & RCU_ADDCTL_CK48MSEL;
    RCU_ADDCTL = reg;
}

/*!
    \brief      configure the FMC clock source selection (API_ID(0x001AU))
    \param[in]  fmc_clock_source: FMC clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_FMC_CK_AHB: CK_AHB clock selected as FMC source clock
      \arg        RCU_FMC_CK_SYS: system clock selected as FMC source clock
      \arg        RCU_FMC_CK_PLL0: CK_PLL0 clock selected as FMC source clock
      \arg        RCU_FMC_CK_PLL1: CK_PLL1 clock selected as FMC source clock
    \param[in]  fmc_clock_div: FMC clock division factor
                only one parameter can be selected which is shown as below:
      \arg        RCU_FMC_DIVx: (x = 1...16)
    \param[out] none
    \retval     none
*/
void rcu_fmc_clock_config(uint32_t fmc_clock_source, uint32_t fmc_clock_div)
{
    uint32_t reg;

    reg = RCU_ADDCTL;
    /* reset the FMC bit and set according to fmc_clock_source */
    reg &= ~(RCU_ADDCTL_FMCSEL | RCU_ADDCTL_FMCDIV);
    reg |= (fmc_clock_source & RCU_ADDCTL_FMCSEL) | (fmc_clock_div & RCU_ADDCTL_FMCDIV);
    RCU_ADDCTL = reg;
}

/*!
    \brief      configure the LXTAL drive capability (API_ID(0x001BU))
    \param[in]  lxtal_dricap: drive capability of LXTAL
                only one parameter can be selected which is shown as below:
      \arg        RCU_LXTAL_LOWDRI: lower driving capability
      \arg        RCU_LXTAL_MED_LOWDRI: medium low driving capability
      \arg        RCU_LXTAL_MED_HIGHDRI: medium high driving capability
      \arg        RCU_LXTAL_HIGHDRI: higher driving capability
    \param[out] none
    \retval     none
*/
void rcu_lxtal_drive_capability_config(uint32_t lxtal_dricap)
{
    uint32_t reg;

    reg = RCU_BDCTL;

    /* reset the LXTALDRI bits and set according to lxtal_dricap */
    reg &= ~RCU_BDCTL_LXTALDRI;
    reg |= lxtal_dricap & RCU_BDCTL_LXTALDRI;
    RCU_BDCTL = reg;
}

/*!
    \brief      wait for oscillator stabilization flags is SET or oscillator startup is timeout (API_ID(0x001CU))
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: high speed crystal oscillator(HXTAL)
      \arg        RCU_LXTAL: low speed crystal oscillator(LXTAL)
      \arg        RCU_IRC8M: internal 8M RC oscillators(IRC8M)
      \arg        RCU_IRC48M: internal 48M RC oscillators(IRC48M)
      \arg        RCU_IRC40K: internal 40K RC oscillator(IRC40K)
      \arg        RCU_PLL0_CK: phase locked loop 0
      \arg        RCU_PLL1_CK: phase locked loop 1
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
ErrStatus rcu_osci_stab_wait(rcu_osci_type_enum osci)
{
    uint32_t stb_cnt = 0U;
    ErrStatus reval = ERROR;
    FlagStatus osci_stat = RESET;

    switch(osci) {
    /* wait HXTAL stable */
    case RCU_HXTAL:
        while((RESET == osci_stat) && (HXTAL_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = rcu_flag_get(RCU_FLAG_HXTALSTB);
            stb_cnt++;
        }

        /* check whether flag is set or not */
        if(RESET != rcu_flag_get(RCU_FLAG_HXTALSTB)) {
            reval = SUCCESS;
        }
        break;

    /* wait LXTAL stable */
    case RCU_LXTAL:
        while((RESET == osci_stat) && (LXTAL_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = rcu_flag_get(RCU_FLAG_LXTALSTB);
            stb_cnt++;
        }

        /* check whether flag is set or not */
        if(RESET != rcu_flag_get(RCU_FLAG_LXTALSTB)) {
            reval = SUCCESS;
        }
        break;

    /* wait IRC8M stable */
    case RCU_IRC8M:
        while((RESET == osci_stat) && (IRC8M_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = rcu_flag_get(RCU_FLAG_IRC8MSTB);
            stb_cnt++;
        }

