wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Source/gd32f50x_rcu.c
        /* check whether flag is set or not */
        if(RESET != rcu_flag_get(RCU_FLAG_IRC8MSTB)) {
            reval = SUCCESS;
        }
        break;

    /* wait IRC48M stable */
    case RCU_IRC48M:
        while((RESET == osci_stat) && (OSC_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = rcu_flag_get(RCU_FLAG_IRC48MSTB);
            stb_cnt++;
        }

        /* check whether flag is set or not */
        if(RESET != rcu_flag_get(RCU_FLAG_IRC48MSTB)) {
            reval = SUCCESS;
        }
        break;

    /* wait IRC40K stable */
    case RCU_IRC40K:
        while((RESET == osci_stat) && (OSC_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = rcu_flag_get(RCU_FLAG_IRC40KSTB);
            stb_cnt++;
        }

        /* check whether flag is set or not */
        if(RESET != rcu_flag_get(RCU_FLAG_IRC40KSTB)) {
            reval = SUCCESS;
        }
        break;

    /* wait PLL0 stable */
    case RCU_PLL0_CK:
        while((RESET == osci_stat) && (OSC_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = rcu_flag_get(RCU_FLAG_PLL0STB);
            stb_cnt++;
        }

        /* check whether flag is set or not */
        if(RESET != rcu_flag_get(RCU_FLAG_PLL0STB)) {
            reval = SUCCESS;
        }
        break;

    /* wait PLL1 stable */
    case RCU_PLL1_CK:
        while((RESET == osci_stat) && (OSC_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = rcu_flag_get(RCU_FLAG_PLL1STB);
            stb_cnt++;
        }

        /* check whether flag is set or not */
        if(RESET != rcu_flag_get(RCU_FLAG_PLL1STB)) {
            reval = SUCCESS;
        }
        break;

    default:
        break;
    }

    /* return value */
    return reval;
}

/*!
    \brief      turn on the oscillator (API_ID(0x001DU))
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: high speed crystal oscillator(HXTAL)
      \arg        RCU_LXTAL: low speed crystal oscillator(LXTAL)
      \arg        RCU_IRC8M: internal 8M RC oscillators(IRC8M)
      \arg        RCU_IRC48M: internal 48M RC oscillators(IRC48M)
      \arg        RCU_IRC40K: internal 40K RC oscillator(IRC40K)
      \arg        RCU_PLL0_CK: phase locked loop 0(PLL0)
      \arg        RCU_PLL1_CK: phase locked loop 1(PLL1)
    \param[out] none
    \retval     none
*/
void rcu_osci_on(rcu_osci_type_enum osci)
{
    RCU_REG_VAL(osci) |= BIT(RCU_BIT_POS(osci));
}

/*!
    \brief      turn off the oscillator (API_ID(0x001EU))
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: high speed crystal oscillator(HXTAL)
      \arg        RCU_LXTAL: low speed crystal oscillator(LXTAL)
      \arg        RCU_IRC16M: internal 8M RC oscillators(IRC8M)
      \arg        RCU_IRC48M: internal 48M RC oscillators(IRC48M)
      \arg        RCU_IRC40K: internal 40K RC oscillator(IRC40K)
      \arg        RCU_PLL0_CK: phase locked loop 0(PLL0)
      \arg        RCU_PLL1_CK: phase locked loop 1(PLL1)
    \param[out] none
    \retval     none
*/
void rcu_osci_off(rcu_osci_type_enum osci)
{
    RCU_REG_VAL(osci) &= ~BIT(RCU_BIT_POS(osci));
}

/*!
    \brief      enable the oscillator bypass mode, HXTALEN or LXTALEN must be reset before it (API_ID(0x001FU))
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: high speed crystal oscillator(HXTAL)
      \arg        RCU_LXTAL: low speed crystal oscillator(LXTAL)
    \param[out] none
    \retval     none
*/
void rcu_osci_bypass_mode_enable(rcu_osci_type_enum osci)
{
    uint32_t reg;

    switch(osci) {
    /* enable HXTAL to bypass mode */
    case RCU_HXTAL:
        reg = RCU_CTL;
        RCU_CTL &= ~RCU_CTL_HXTALEN;
        RCU_CTL = (reg | RCU_CTL_HXTALBPS);
        break;
    /* enable LXTAL to bypass mode */
    case RCU_LXTAL:
        reg = RCU_BDCTL;
        RCU_BDCTL &= ~RCU_BDCTL_LXTALEN;
        RCU_BDCTL = (reg | RCU_BDCTL_LXTALBPS);
        break;
    default:
        break;
    }
}

/*!
    \brief      disable the oscillator bypass mode, HXTALEN or LXTALEN must be reset before it (API_ID(0x0020U))
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: high speed crystal oscillator(HXTAL)
      \arg        RCU_LXTAL: low speed crystal oscillator(LXTAL)
    \param[out] none
    \retval     none
*/
void rcu_osci_bypass_mode_disable(rcu_osci_type_enum osci)
{
    uint32_t reg;

    switch(osci) {
    /* disable HXTAL to bypass mode */
    case RCU_HXTAL:
        reg = RCU_CTL;
        RCU_CTL &= ~RCU_CTL_HXTALEN;
        RCU_CTL = (reg & ~RCU_CTL_HXTALBPS);
        break;
    /* disable LXTAL to bypass mode */
    case RCU_LXTAL:
        reg = RCU_BDCTL;
        RCU_BDCTL &= ~RCU_BDCTL_LXTALEN;
        RCU_BDCTL = (reg & ~RCU_BDCTL_LXTALBPS);
        break;
    default:
        break;
    }
}

/*!
    \brief      set the IRC8M adjust value (API_ID(0x0021U))
    \param[in]  irc8m_adjval: IRC8M adjust value, must be between 0 and 0x1F
      \arg        0x00 - 0x1F
    \param[out] none
    \retval     none
*/
void rcu_irc8m_adjust_value_set(uint32_t irc8m_adjval)
{
    uint32_t reg;

    reg = RCU_CTL;
    /* reset the IRC8MADJ bits and set according to irc8m_adjval */
    reg &= ~RCU_CTL_IRC8MADJ;
    RCU_CTL = (reg | ((irc8m_adjval & RCU_IRC8M_ADJUST_MASK) << RCU_IRC8M_ADJUST_OFFSET));
}

/*!
    \brief      enable the HXTAL clock monitor (API_ID(0x0022U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_hxtal_clock_monitor_enable(void)
{
    RCU_CTL |= RCU_CTL_HCKMEN;
}

/*!
    \brief      disable the HXTAL clock monitor (API_ID(0x0023U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_hxtal_clock_monitor_disable(void)
{
    RCU_CTL &= ~RCU_CTL_HCKMEN;
}

/*!
    \brief      enable the LXTAL clock monitor (API_ID(0x0024U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_lxtal_clock_monitor_enable(void)
{
    RCU_BDCTL |= RCU_BDCTL_LCKMEN;
}

/*!
    \brief      disable the LXTAL clock monitor (API_ID(0x0025U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_lxtal_clock_monitor_disable(void)
{
    RCU_BDCTL &= ~RCU_BDCTL_LCKMEN;
}

/*!
    \brief      enable the clock frequency monitor (API_ID(0x0026U))
    \param[in]  ckfm: clock frequency monitor enable types, refer to rcu_ckfm_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_IRC8MCKFM: IRC8M clock frequency monitor
      \arg        RCU_HXTALCKFM: HXTAL clock frequency monitor
      \arg        RCU_PLL0PCKFM: PLL0P clock frequency monitor
      \arg        RCU_PLL1CKFM: PLL1 clock frequency monitor
    \param[out] none
    \retval     none
*/
void rcu_clock_freq_monitor_enable(rcu_ckfm_enum ckfm)
{
    RCU_REG_VAL(ckfm) |= BIT(RCU_BIT_POS(ckfm));
}

/*!
    \brief      disable the clock frequency monitor (API_ID(0x0027U))
    \param[in]  ckfm: clock frequency monitor enable types, refer to rcu_ckfm_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_IRC8MCKFM: IRC8M clock frequency monitor
      \arg        RCU_HXTALCKFM: HXTAL clock frequency monitor
      \arg        RCU_PLL0PCKFM: PLL0P clock frequency monitor
      \arg        RCU_PLL1CKFM: PLL1 clock frequency monitor
    \param[out] none
    \retval     none
*/
void rcu_clock_freq_monitor_disable(rcu_ckfm_enum ckfm)
{
    RCU_REG_VAL(ckfm) &= ~BIT(RCU_BIT_POS(ckfm));
}

/*!
    \brief      IRC8M clock frequency monitor range configuration (API_ID(0x0028U))
    \param[in]  range: IRC8M clock frequency monitor configuration
                only one parameter can be selected which is shown as below:
      \arg        RCU_IRC8MCKFMC_5_PERCENT: the IRC8M clock frequency monitoring range is ±5%
      \arg        RCU_IRC8MCKFMC_10_PERCENT: the IRC8M clock frequency monitoring range is ±10%
      \arg        RCU_IRC8MCKFMC_15_PERCENT: the IRC8M clock frequency monitoring range is ±15%
      \arg        RCU_IRC8MCKFMC_20_PERCENT: the IRC8M clock frequency monitoring range is ±20%
    \param[out] none
    \retval     none
*/
void rcu_irc8m_freq_monitor_config(uint32_t range)
{
    uint32_t reg;

    reg = RCU_CKFMCFG0;
    reg &= ~RCU_CKFMCFG0_IRC8MCKFMC;
    RCU_CKFMCFG0 = reg | (range & RCU_CKFMCFG0_IRC8MCKFMC);
}

/*!
    \brief      HXTAL clock frequency monitor threshold configuration (API_ID(0x0029U))
    \param[in]  lthreshold: low frequency threshold configuration
      \arg        0x00 - 0xfff
    \param[in]  hthreshold: high frequency threshold configuration
      \arg        0x00 - 0xfff
    \param[out] none
    \retval     none
*/
void rcu_hxtal_monitor_threshold_config(uint32_t lthreshold, uint32_t hthreshold)
{
    uint32_t reg;

