wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Source/gd32f50x_rcu.c
    reg = RCU_CKFMCFG1;
    reg &= ~(RCU_CKFMCFG1_HXTALCKFMIN | RCU_CKFMCFG1_HXTALCKFMAX);
    RCU_CKFMCFG1 = reg | ((lthreshold << 13U) & RCU_CKFMCFG1_HXTALCKFMIN) | ((hthreshold << 1U) & RCU_CKFMCFG1_HXTALCKFMAX);
}

/*!
    \brief      PLL0P clock frequency monitor threshold configuration (API_ID(0x002AU))
    \param[in]  lthreshold: low frequency threshold configuration
      \arg        0x00 - 0x3ff
    \param[in]  hthreshold: high frequency threshold configuration
      \arg        0x00 - 0x3ff
    \param[out] none
    \retval     none
*/
void rcu_pll0p_monitor_threshold_config(uint32_t lthreshold, uint32_t hthreshold)
{
    uint32_t reg;

    reg = RCU_CKFMCFG2;
    reg &= ~(RCU_CKFMCFG2_PLL0PCKFMIN | RCU_CKFMCFG2_PLL0PCKFMAX);
    RCU_CKFMCFG2 = reg | ((lthreshold << 12U) & RCU_CKFMCFG2_PLL0PCKFMIN) | ((hthreshold << 1U) & RCU_CKFMCFG2_PLL0PCKFMAX);
}

/*!
    \brief      PLL1 clock frequency monitor threshold configuration (API_ID(0x002BU))
    \param[in]  lthreshold: low frequency threshold configuration
      \arg        0x00 - 0x3ff
    \param[in]  hthreshold: high frequency threshold configuration
      \arg        0x00 - 0x3ff
    \param[out] none
    \retval     none
*/
void rcu_pll1_monitor_threshold_config(uint32_t lthreshold, uint32_t hthreshold)
{
    uint32_t reg;

    reg = RCU_CKFMCFG3;
    reg &= ~(RCU_CKFMCFG3_PLL1CKFMIN | RCU_CKFMCFG3_PLL1CKFMAX);
    RCU_CKFMCFG3 = reg | ((lthreshold << 12U) & RCU_CKFMCFG2_PLL0PCKFMIN) | ((hthreshold << 1U) & RCU_CKFMCFG2_PLL0PCKFMAX);
}

/*!
    \brief      set the deep sleep mode voltage (API_ID(0x002CU))
    \param[in]  dsvol: deep sleep mode voltage
                only one parameter can be selected which is shown as below:
      \arg        RCU_DEEPSLEEP_V_0: the core voltage is default value
      \arg        RCU_DEEPSLEEP_V_1: the core voltage is (default value-0.05)V
      \arg        RCU_DEEPSLEEP_V_2: the core voltage is (default value-0.1)V
      \arg        RCU_DEEPSLEEP_V_3: the core voltage is (default value-0.15)V
      \arg        RCU_DEEPSLEEP_V_4: the core voltage is (default value-0.2)V
      \arg        RCU_DEEPSLEEP_V_5: the core voltage is (default value-0.25)V
      \arg        RCU_DEEPSLEEP_V_6: the core voltage is (default value-0.3)V(customers are not recommended to use it)
      \arg        RCU_DEEPSLEEP_V_7: the core voltage is (default value-0.35)V(customers are not recommended to use it)
    \param[out] none
    \retval     none
*/
void rcu_deepsleep_voltage_set(uint32_t dsvol)
{
    dsvol &= RCU_DSV_DSLPVS;
    RCU_DSV |= dsvol & RCU_DSV_DSLPVS;
}

/*!
    \brief      delay before switch to IRC8M clock and enter deep-sleep mode (API_ID(0x002DU))
    \param[in]  irc8m_cnt: 1 ~ 31
    \param[out] none
    \retval     none
*/
void rcu_deepsleep_switch_delay_set(uint32_t irc8m_cnt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RCU_SWITCH_DELAY(irc8m_cnt)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x002DU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        RCU_DSV &= ~RCU_DSV_SWDLY;
        RCU_DSV |= RCU_SWDLY_COUNT(irc8m_cnt);
    }
}

/*!
    \brief      lock rcu register (API_ID(0x002EU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_reg_lock(void)
{
    RCU_LOCK |= RCU_LOCK_LOCK;
}


/*!
    \brief      unlock rcu register (API_ID(0x002FU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_reg_unlock(void)
{
    RCU_LOCK &= ~RCU_LOCK_LOCK;
}

/*!
    \brief      config PLL0/PLL1 bandwidth (API_ID(0x0030U))
    \param[in]  pll0_bw: pll0 bandwidth configuration, must be between 0 and 0xF
      \arg        0 ~ 15
    \param[in]  pll1_bw: pll1 bandwidth configuration, must be between 0 and 0xF
      \arg        0 ~ 15
    \param[out] none
    \retval     none
*/
void rcu_pll_bandwidth_config(uint32_t pll0_bw, uint32_t pll1_bw)
{
    uint32_t reg;

    reg = RCU_PLLBWCFG;
    /* reset the IRC8MADJ bits and set according to irc8m_adjval */
    reg &= ~(RCU_PLLBWCFG_PLL0_BW_CFG | RCU_PLLBWCFG_PLL1_BW_CFG);
    RCU_PLLBWCFG = (reg | PLL0_BW_CFG(pll0_bw) | PLL1_BW_CFG(pll1_bw));
}

/*!
    \brief      get the system clock, bus and peripheral clock frequency (API_ID(0x0031U))
    \param[in]  clock: the clock frequency which to get
                only one parameter can be selected which is shown as below:
      \arg        CK_SYS: system clock frequency
      \arg        CK_AHB: AHB clock frequency
      \arg        CK_APB1: APB1 clock frequency
      \arg        CK_APB2: APB2 clock frequency
      \arg        CK_PLL0: PLL0 clock frequency
    \param[out] none
    \retval     clock frequency of system, AHB, APB1, APB2
*/
uint32_t rcu_clock_freq_get(rcu_clock_freq_enum clock)
{
    uint32_t sws, ck_freq = 0U;
    uint32_t cksys_freq, ahb_freq, apb1_freq, apb2_freq, pll0_freq;
    uint32_t pll0sel, pll1sel, prediv0, pll0mf, prediv1, pll1mf, ck_src, idx, clk_exp;

    /* exponent of AHB, APB1 and APB2 clock divider */
    uint8_t ahb_exp[16] = {0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 6, 7, 8, 9};
    uint8_t apb1_exp[8] = {0, 0, 0, 0, 1, 2, 3, 4};
    uint8_t apb2_exp[8] = {0, 0, 0, 0, 1, 2, 3, 4};

    sws = GET_BITS(RCU_CFG0, 2, 3);
    switch(sws) {
    /* IRC8M is selected as CK_SYS */
    case SEL_IRC8M:
        cksys_freq = IRC8M_VALUE;
        break;
    /* HXTAL is selected as CK_SYS */
    case SEL_HXTAL:
        cksys_freq = HXTAL_VALUE;
        break;
    /* PLL0P is selected as CK_SYS */
    case SEL_PLL0P:
        /* PLL0 clock source selection, IRC8M, IRC48M, HXTAL, or PLL1*/
        pll0sel = (RCU_CFG1 & RCU_CFG1_PLL0SEL);

        if(RCU_PLL0SRC_IRC8M == pll0sel) {
            /* PLL0 clock source is IRC8M*/
            ck_src = IRC8M_VALUE;
        } else if(RCU_PLL0SRC_IRC48M == pll0sel) {
            /* PLL0 clock source is IRC48M*/
            ck_src = IRC48M_VALUE;
        } else if(RCU_PLL0SRC_HXTAL == pll0sel) {
            /* PLL0 clock source is HXTAL*/
            ck_src = HXTAL_VALUE;
        } else if(RCU_PLL0SRC_CKPLL1 == pll0sel) {
            /* PLL1 clock source is HXTAL or IRC48M */
            pll1sel = (RCU_CFG1 & RCU_CFG1_PLL1SEL);

            if(RCU_PLL1SRC_HXTAL == pll1sel) {
                /* PLL1 clock source is HXTAL */
                ck_src = HXTAL_VALUE;
            } else {
                /* PLL1 clock source is IRC48 */
                ck_src = IRC48M_VALUE;
            }

            prediv1 = ((RCU_CFG1 & RCU_CFG1_PREDIV1) >> RCU_CFG1_PREDIV1_OFFSET) + 1U;
            /* PLL1 multiplication factor */
            pll1mf = (uint32_t)((RCU_CFG1 & RCU_CFG1_PLL1MF) >> RCU_CFG1_PLL1MF_OFFSET);
            ck_src = (ck_src / prediv1) * pll1mf;
        } else {
        }

        /* PLL0 multiplication factor */
        prediv0 = ((RCU_CFG1 & RCU_CFG1_PREDIV0) >> RCU_CFG1_PREDIV0_OFFSET) + 1U;
        /* PLL0 multiplication factor */
        pll0mf = GET_BITS(RCU_CFG0, 18, 21);
        pll0mf |= GET_BITS(RCU_CFG0, 29, 30) << 4U;

