wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Source/gd32f50x_rcu.c
        cksys_freq = ck_src * pll0mf / prediv0;
        break;
    default:
        break;
    }

    /* calculate AHB clock frequency */
    idx = GET_BITS(RCU_CFG0, 4, 7);
    clk_exp = ahb_exp[idx];
    ahb_freq = cksys_freq >> clk_exp;

    /* calculate APB1 clock frequency */
    idx = GET_BITS(RCU_CFG0, 8, 10);
    clk_exp = apb1_exp[idx];
    apb1_freq = ahb_freq >> clk_exp;

    /* calculate APB2 clock frequency */
    idx = GET_BITS(RCU_CFG0, 11, 13);
    clk_exp = apb2_exp[idx];
    apb2_freq = ahb_freq >> clk_exp;

    /* return the clocks frequency */
    switch(clock) {
    case CK_SYS:
        ck_freq = cksys_freq;
        break;
    case CK_AHB:
        ck_freq = ahb_freq;
        break;
    case CK_APB1:
        ck_freq = apb1_freq;
        break;
    case CK_APB2:
        ck_freq = apb2_freq;
        break;
    case CK_PLL0:
        /* PLL0 clock source selection, IRC8M, IRC48M, HXTAL, or PLL1*/
        pll0sel = (RCU_CFG1 & RCU_CFG1_PLL0SEL);

        if(RCU_PLL0SRC_IRC8M == pll0sel) {
            /* PLL0 clock source is IRC8M*/
            ck_src = IRC8M_VALUE;
        } else if(RCU_PLL0SRC_IRC48M == pll0sel) {
            /* PLL0 clock source is IRC48M*/
            ck_src = IRC48M_VALUE;
        } else if(RCU_PLL0SRC_HXTAL == pll0sel) {
            /* PLL0 clock source is HXTAL*/
            ck_src = HXTAL_VALUE;
        } else if(RCU_PLL0SRC_CKPLL1 == pll0sel) {
            /* PLL1 clock source is HXTAL or IRC48M */
            pll1sel = (RCU_CFG1 & RCU_CFG1_PLL1SEL);

            if(RCU_PLL1SRC_HXTAL == pll1sel) {
                /* PLL1 clock source is HXTAL */
                ck_src = HXTAL_VALUE;
            } else {
                /* PLL1 clock source is IRC48 */
                ck_src = IRC48M_VALUE;
            }

            prediv1 = ((RCU_CFG1 & RCU_CFG1_PREDIV1) >> RCU_CFG1_PREDIV1_OFFSET) + 1U;
            /* PLL1 multiplication factor */
            pll1mf = (uint32_t)((RCU_CFG1 & RCU_CFG1_PLL1MF) >> RCU_CFG1_PLL1MF_OFFSET);
            ck_src = (ck_src / prediv1) * pll1mf;
        } else {
        }

        /* PLL0 multiplication factor */
        pll0mf = GET_BITS(RCU_CFG0, 18, 21);
        pll0mf |= GET_BITS(RCU_CFG0, 29, 30) << 4U;

        pll0_freq = ck_src * pll0mf;
        ck_freq = pll0_freq;
        break;
    default:
        break;
    }
    return ck_freq;
}

/*!
    \brief      get the clock stabilization, peripheral reset and clock frequency failure flags (API_ID(0x0032U))
    \param[in]  flag: the clock stabilization and peripheral reset flags, refer to rcu_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_FLAG_IRC8MSTB: IRC8M stabilization flag
      \arg        RCU_FLAG_HXTALSTB: HXTAL stabilization flag
      \arg        RCU_FLAG_PLL0STB: PLL0 stabilization flag
      \arg        RCU_FLAG_PLL1STB: PLL1 stabilization flag(CL series only)
      \arg        RCU_FLAG_LXTALSTB: LXTAL stabilization flag
      \arg        RCU_FLAG_IRC40KSTB: IRC40K stabilization flag
      \arg        RCU_FLAG_IRC48MSTB: IRC48M stabilization flag
      \arg        RCU_FLAG_EPRST: external PIN reset flag
      \arg        RCU_FLAG_PORRST: power reset flag
      \arg        RCU_FLAG_SWRST: software reset flag
      \arg        RCU_FLAG_FWDGTRST: free watchdog timer reset flag
      \arg        RCU_FLAG_WWDGTRST: window watchdog timer reset flag
      \arg        RCU_FLAG_LPRST: low-power reset flag
      \arg        RCU_FLAG_IRC8MCKFF: IRC8M clock frequency failure flag
      \arg        RCU_FLAG_HXTALCKFF: HXTAL clock frequency failure flag
      \arg        RCU_FLAG_PLL0PCKFF: PLL0P clock frequency failure flag
      \arg        RCU_FLAG_PLL1CKFF: PLL1 clock frequency failure flag
    \param[out] none
    \retval     FlagStatus: status of flag (RESET or SET)
*/
FlagStatus rcu_flag_get(rcu_flag_enum flag)
{
    FlagStatus reval;
    /* get the rcu flag */
    if(RESET != (RCU_REG_VAL(flag) & BIT(RCU_BIT_POS(flag)))) {
        reval = SET;
    } else {
        reval = RESET;
    }
    return reval;
}

/*!
    \brief      clear clock frequency failure flags (API_ID(0x0033U))
    \param[in]  flag: clock frequency failure flag, refer to rcu_flag_clear_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_FLAG_IRC8MCKFF_CLR: IRC8M clock frequency failure interrupt flag clear
      \arg        RCU_FLAG_HXTALCKFF_CLR: HXTAL clock frequency failure interrupt flag clear
      \arg        RCU_FLAG_PLL0PCKFF_CLR: PLL0P clock frequency failure interrupt flag clear
      \arg        RCU_FLAG_PLL1CKFF_CLR: PLL1 clock frequency failure interrupt flag clear
    \param[out] none
    \retval     none
*/
void rcu_flag_clear(rcu_flag_clear_enum flag)
{
    RCU_REG_VAL(flag) |= BIT(RCU_BIT_POS(flag));
}

/*!
    \brief      clear all the reset flag (API_ID(0x0034U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_all_reset_flag_clear(void)
{
    RCU_RSTSCK |= RCU_RSTSCK_RSTFC;
}

/*!
    \brief      enable the clock interrupt (API_ID(0x0035U))
    \param[in]  interrupt clock stabilization interrupt, refer to rcu_int_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_INT_IRC40KSTB: IRC40K stabilization interrupt enable
      \arg        RCU_INT_LXTALSTB: LXTAL stabilization interrupt enable
      \arg        RCU_INT_IRC8MSTB: IRC8M stabilization interrupt enable
      \arg        RCU_INT_HXTALSTB: HXTAL stabilization interrupt enable
      \arg        RCU_INT_PLL0STB: PLL0 stabilization interrupt enable
      \arg        RCU_INT_PLL1STB: PLL1 stabilization interrupt enable
      \arg        RCU_INT_LCKM: LXTAL clock stuck interrupt enable
      \arg        RCU_INT_IRC48MSTB: IRC48M stabilization interrupt enable
      \arg        RCU_INT_IRC8MCKFF: IRC8M clock frequency failure interrupt enable
      \arg        RCU_INT_HXTALCKFF: HXTAL clock frequency failure interrupt enable
      \arg        RCU_INT_PLL0PCKFF: PLL0P clock frequency failure interrupt enable
      \arg        RCU_INT_PLL1CKFF: PLL1 clock frequency failure interrupt enable
    \param[out] none
    \retval     none
*/
void rcu_interrupt_enable(rcu_int_enum interrupt)
{
    RCU_REG_VAL(interrupt) |= BIT(RCU_BIT_POS(interrupt));
}

/*!
    \brief      disable the clock interrupt (API_ID(0x0036U))
    \param[in]  interrupt clock stabilization interrupt, refer to rcu_int_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_INT_IRC40KSTB: IRC40K stabilization interrupt disable
      \arg        RCU_INT_LXTALSTB: LXTAL stabilization interrupt disable
      \arg        RCU_INT_IRC8MSTB: IRC8M stabilization interrupt disable
      \arg        RCU_INT_HXTALSTB: HXTAL stabilization interrupt disable
      \arg        RCU_INT_PLL0STB: PLL0 stabilization interrupt disable
      \arg        RCU_INT_PLL1STB: PLL1 stabilization interrupt disable
      \arg        RCU_INT_LCKM: LXTAL clock stuck interrupt enable
      \arg        RCU_INT_IRC48MSTB: IRC48M stabilization interrupt disable
      \arg        RCU_INT_IRC8MCKFF: IRC8M clock frequency failure interrupt disable
      \arg        RCU_INT_HXTALCKFF: HXTAL clock frequency failure interrupt disable
      \arg        RCU_INT_PLL0PCKFF: PLL0P clock frequency failure interrupt disable
      \arg        RCU_INT_PLL1CKFF: PLL1 clock frequency failure interrupt disable
    \param[out] none
    \retval     none
*/
void rcu_interrupt_disable(rcu_int_enum interrupt)
{
    RCU_REG_VAL(interrupt) &= ~BIT(RCU_BIT_POS(interrupt));
}

/*!
    \brief      get the clock interrupt flags (API_ID(0x0037U))
    \param[in]  int_flag: interrupt and clock stuck flags, refer to rcu_int_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_INT_FLAG_IRC40KSTB: IRC40K stabilization interrupt flag
      \arg        RCU_INT_FLAG_LXTALSTB: LXTAL stabilization interrupt flag
      \arg        RCU_INT_FLAG_IRC8MSTB: IRC8M stabilization interrupt flag
      \arg        RCU_INT_FLAG_HXTALSTB: HXTAL stabilization interrupt flag
      \arg        RCU_INT_FLAG_PLL0STB: PLL0 stabilization interrupt flag
      \arg        RCU_INT_FLAG_PLL1STB: PLL1 stabilization interrupt flag
      \arg        RCU_INT_FLAG_HCKM: HXTAL clock stuck interrupt flag
      \arg        RCU_INT_FLAG_LCKM: LXTAL clock stuck interrupt flag
      \arg        RCU_INT_FLAG_IRC48MSTB: IRC48M stabilization interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus rcu_interrupt_flag_get(rcu_int_flag_enum int_flag)
{
    FlagStatus reval;
    /* get the rcu interrupt flag */
    if(RESET != (RCU_REG_VAL(int_flag) & BIT(RCU_BIT_POS(int_flag)))) {
        reval = SET;
    } else {
        reval = RESET;
    }
    return reval;
}

/*!
    \brief      clear the clock interrupt flags (API_ID(0x0038U))
    \param[in]  int_flag: clock stabilization and stuck interrupt flags clear, refer to rcu_int_flag_clear_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_INT_FLAG_IRC40KSTB_CLR: IRC40K stabilization interrupt flag clear
      \arg        RCU_INT_FLAG_LXTALSTB_CLR: LXTAL stabilization interrupt flag clear
      \arg        RCU_INT_FLAG_IRC8MSTB_CLR: IRC8M stabilization interrupt flag clear
      \arg        RCU_INT_FLAG_HXTALSTB_CLR: HXTAL stabilization interrupt flag clear
      \arg        RCU_INT_FLAG_PLL0STB_CLR: PLL0 stabilization interrupt flag clear
      \arg        RCU_INT_FLAG_PLL1STB_CLR: PLL1 stabilization interrupt flag clear
      \arg        RCU_INT_FLAG_HCKM_CLR: HXTAL clock stuck interrupt flag clear
      \arg        RCU_INT_FLAG_LCKM_CLR: LXTAL clock stuck interrupt flag clear
      \arg        RCU_INT_FLAG_IRC48MSTB_CLR: IRC48M stabilization interrupt flag clear
    \param[out] none
    \retval     none
*/
void rcu_interrupt_flag_clear(rcu_int_flag_clear_enum int_flag)
{
    RCU_REG_VAL(int_flag) |= BIT(RCU_BIT_POS(int_flag));
}
